balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ96GA006.PIC
        <edc:SFRDef edc:access="n-----nnnn--nn--" edc:cname="TRISG" edc:desc="" edc:impl="0x3cc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-----1111--11--" edc:name="TRISG" edc:nzwidth="0x10" edc:por="1-----1111--11--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TRISG2" edc:desc="" edc:mask="0x1" edc:name="TRISG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG3" edc:desc="" edc:mask="0x1" edc:name="TRISG3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TRISG6" edc:desc="" edc:mask="0x1" edc:name="TRISG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG7" edc:desc="" edc:mask="0x1" edc:name="TRISG7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG8" edc:desc="" edc:mask="0x1" edc:name="TRISG8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG9" edc:desc="" edc:mask="0x1" edc:name="TRISG9" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="TRISG15" edc:desc="" edc:mask="0x1" edc:name="TRISG15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISG" edc:desc="" edc:mask="0xffff" edc:name="TRISG" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-----nnnn--nn--" edc:cname="PORTG" edc:desc="" edc:impl="0x3cc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="x-----xxxx--xx--" edc:name="PORTG" edc:nzwidth="0x10" edc:por="x-----xxxx--xx--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RG2" edc:desc="" edc:mask="0x1" edc:name="RG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG3" edc:desc="" edc:mask="0x1" edc:name="RG3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RG6" edc:desc="" edc:mask="0x1" edc:name="RG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG7" edc:desc="" edc:mask="0x1" edc:name="RG7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG8" edc:desc="" edc:mask="0x1" edc:name="RG8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RG9" edc:desc="" edc:mask="0x1" edc:name="RG9" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="RG15" edc:desc="" edc:mask="0x1" edc:name="RG15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RG" edc:desc="" edc:mask="0xffff" edc:name="RG" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-----nnnn--nn--" edc:cname="LATG" edc:desc="" edc:impl="0x3cc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-----0000--00--" edc:name="LATG" edc:nzwidth="0x10" edc:por="0-----0000--00--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="LATG2" edc:desc="" edc:mask="0x1" edc:name="LATG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG3" edc:desc="" edc:mask="0x1" edc:name="LATG3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="LATG6" edc:desc="" edc:mask="0x1" edc:name="LATG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG7" edc:desc="" edc:mask="0x1" edc:name="LATG7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG8" edc:desc="" edc:mask="0x1" edc:name="LATG8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATG9" edc:desc="" edc:mask="0x1" edc:name="LATG9" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="LATG15" edc:desc="" edc:mask="0x1" edc:name="LATG15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATG" edc:desc="" edc:mask="0xffff" edc:name="LATG" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="18"/>
        <edc:SFRDef edc:access="--------------nn" edc:cname="PADCFG1" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PADCFG1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMPTTL" edc:desc="" edc:mask="0x1" edc:name="PMPTTL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTSECSEL" edc:desc="" edc:mask="0x1" edc:name="RTSECSEL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTSECSEL0" edc:desc="" edc:mask="0x1" edc:name="RTSECSEL0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADC1BUF0" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADC1BUF0" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1BUF0" edc:desc="" edc:mask="0x3ff" edc:name="ADC1BUF0" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADC1BUF1" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADC1BUF1" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1BUF1" edc:desc="" edc:mask="0x3ff" edc:name="ADC1BUF1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rrrrrrrrrr" edc:cname="ADC1BUF2" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------uuuuuuuuuu" edc:name="ADC1BUF2" edc:nzwidth="0x10" edc:por="------xxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADC1BUF2" edc:desc="" edc:mask="0x3ff" edc:name="ADC1BUF2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
